package tasks;

import org.junit.Test;

import static org.junit.Assert.*;

public class Task05Test {
    @Test
    public void test() {

        String expected = """
                Обработка результатов экзамена
                Исходные оценки: [5,5,4,4,1,2,5,5,4,3]
                Результаты экзамена:
                пятерок - 40% (4)
                четверок - 30% (3)
                троек - 10% (1)
                двоек - 10% (1)
                единиц - 10% (1)
                нулей - 0% (0)""";
        int[] vector = {1, 2, 3, 4, 5, 6, 7, 8, 9};
        String actual = Task05.tsk5(vector);

        assertEquals("""
                Обработка результатов экзамена
                Исходные оценки: [5, 5, 4, 2, 2]
                Результаты экзамена:
                пятерок - 40% (2)
                четверок - 20% (1)
                троек - 0% (0)
                двоек - 40% (2)
                единиц - 0% (0)
                нулей - 0% (0)""", Task05.tsk5(new int[]{5, 5, 4, 2, 2}));

        assertEquals("""
                Обработка результатов экзамена
                Исходные оценки: [1, 1, 5, 5, 5, 5, 1, 1, 0, 2]
                Результаты экзамена:
                пятерок - 40% (4)
                четверок - 0% (0)
                троек - 0% (0)
                двоек - 10% (1)
                единиц - 40% (4)
                нулей - 10% (1)""", Task05.tsk5(new int[]{1, 1, 5, 5, 5, 5, 1, 1, 0, 2}));

        assertEquals("Некоррекстно заданы оценки",Task05.tsk5(new int[] {1,2,3,6,5}));
        assertEquals("Где оценки?",Task05.tsk5(new int[0]));



    }

}
